/* A label denoting the name the Picasa Web Albums source. It is a source that allows the user to access all of their photos in Picasa. Do not include ^ in localization.*/
"^Picasa Web Albums" = "Picasa Web Albums";
